In [1]:
import seaborn as sns   
import pandas as pd
import numpy as np

In [20]:
df = sns.load_dataset('titanic')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [21]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [22]:
df.isna().mean()

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [23]:
df['age'] = df['age'].fillna(df.groupby('pclass')['age'].transform('median'))

df.isna().mean()

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.000000
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [24]:
df = df.drop(columns=['deck', 'who'])
df = df.dropna()

df.isna().mean()

survived       0.0
pclass         0.0
sex            0.0
age            0.0
sibsp          0.0
parch          0.0
fare           0.0
embarked       0.0
class          0.0
adult_male     0.0
embark_town    0.0
alive          0.0
alone          0.0
dtype: float64

In [25]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,True,Southampton,no,True

In [26]:
df.value_counts('embarked')

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [27]:
df.memory_usage(deep=True)

Index           7112
survived        7112
pclass          7112
sex            54853
age             7112
sibsp           7112
parch           7112
fare            7112
embarked       51562
class           1184
adult_male       889
embark_town    60039
alive          52791
alone            889
dtype: int64

In [28]:
for column in ['survived', 'pclass', 'sibsp', 'parch']:
    df[column] = df[column].astype(np.int8)

df.memory_usage(deep=True)

Index           7112
survived         889
pclass           889
sex            54853
age             7112
sibsp            889
parch            889
fare            7112
embarked       51562
class           1184
adult_male       889
embark_town    60039
alive          52791
alone            889
dtype: int64

In [29]:
for column in ['sex', 'embarked', 'embark_town', 'alive']:
    df[column] = df[column].astype("category")

df.memory_usage(deep=True)

Index          7112
survived        889
pclass          889
sex            1121
age            7112
sibsp           889
parch           889
fare           7112
embarked       1171
class          1184
adult_male      889
embark_town    1198
alive          1116
alone           889
dtype: int64

In [30]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,True,Southampton,no,True

In [31]:
df = pd.get_dummies(df, columns=['sex', 'embarked', 'embark_town', 'alive'], drop_first=True)

df.head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,alone,sex_male,embarked_Q,embarked_S,embark_town_Queenstown,embark_town_Southampton,alive_yes
0,0,3,22.0,1,0,7.2500,Third,True,False,True,False,True,False,True,False
1,1,1,38.0,1,0,71.2833,First,False,False,False,False,False,False,False,True
2,1,3,26.0,0,0,7.9250,Third,False,True,False,False,True,False,True,True
3,1,1,35.0,1,0,53.1000,First,False,False,False,False,True,False,True,True
4,0,3,35.0,0,0,8.0500,Third,True,True,True,False,True,False,True,False

In [32]:
mappings = {"First": 3, "Second": 2, "Third": 1}
df['class'] = df['class'].map(mappings)

df.head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,alone,sex_male,embarked_Q,embarked_S,embark_town_Queenstown,embark_town_Southampton,alive_yes
0,0,3,22.0,1,0,7.2500,1,True,False,True,False,True,False,True,False
1,1,1,38.0,1,0,71.2833,3,False,False,False,False,False,False,False,True
2,1,3,26.0,0,0,7.9250,1,False,True,False,False,True,False,True,True
3,1,1,35.0,1,0,53.1000,3,False,False,False,False,True,False,True,True
4,0,3,35.0,0,0,8.0500,1,True,True,True,False,True,False,True,False

In [33]:
X = df.iloc[:,:-1]
y = df.iloc[:,-1:]

X.head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,alone,sex_male,embarked_Q,embarked_S,embark_town_Queenstown,embark_town_Southampton
0,0,3,22.0,1,0,7.2500,1,True,False,True,False,True,False,True
1,1,1,38.0,1,0,71.2833,3,False,False,False,False,False,False,False
2,1,3,26.0,0,0,7.9250,1,False,True,False,False,True,False,True
3,1,1,35.0,1,0,53.1000,3,False,False,False,False,True,False,True
4,0,3,35.0,0,0,8.0500,1,True,True,True,False,True,False,True

In [34]:
y.head()

   alive_yes
0      False
1       True
2       True
3       True
4      False

In [35]:
X_test = X.iloc[800:]
X_train = X.iloc[:800]
y_test = y.iloc[800:]
y_train = y.iloc[:800]

## Deep Learning Modeling

In [39]:
X_train.dtypes

survived                       int8
pclass                         int8
age                         float64
sibsp                          int8
parch                          int8
fare                        float64
class                      category
adult_male                     bool
alone                          bool
sex_male                       bool
embarked_Q                     bool
embarked_S                     bool
embark_town_Queenstown         bool
embark_town_Southampton        bool
dtype: object

In [ ]:
y_train.dtypes

In [41]:
import torch
import torch.nn as nn   
from torch.utils.data import DataLoader, TensorDataset
import torch.optim as optim

for columns in X_train.columns:
    X_train[column] = X_train[column].astype(np.float32)

for c in y_train.columns:
    y_train[c] = y_train[c].astype(np.float32)

X = X_train.values
y = y_train.values

X = torch.tensor(X)
y = torch.tensor(y)

dataset = TensorDataset(X, y)
loader = DataLoader(dataset, batch_size=9, shuffle=True)

data_iter = iter(loader)
while True:
    try:
        features, labels = next(data_iter)
        print(f"Features: {features} \n\n Labels: {labels}")
    except StopIteration:
        print("Iterated through all batches")
        break

KeyError: 'alive'